app/controllers/products_controller.rb

	def create
		@product = Product.create(prod_params)
---
INSERT INTO "products" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", ""], ["description", ""], ["created_at", "2018-04-02 00:42:20.273131"], ["updated_at", "2018-04-02 00:42:20.273131"]]

	def update
		@product = Product.find(params[:id])
		@product.update_attributes(prod_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "products" SET "description" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["description", "asdsds"], ["updated_at", "2018-04-02 01:16:45.436488"], ["id", 5]]

	def destroy
		@product = Product.find(params[:id])
		if @product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]